hubertciebiada/VdMot_Controller/software_esp32/src/ServerServices.cpp
/**HEADER*******************************************************************
  project : VdMot Controller

  author : SurfGargano, Lenti84

  Comments:

  Version :

  Modifcations :


***************************************************************************
*
* THIS SOFTWARE IS PROVIDED "AS IS" AND ANY EXPRESSED OR
* IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
* OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
* IN NO EVENT SHALL THE DEVELOPER OR ANY CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
* INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
* (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
* SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
* HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
* STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
* IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
* THE POSSIBILITY OF SUCH DAMAGE.
*
**************************************************************************
  This program is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License.
  See the GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with this program.  If not, see <http://www.gnu.org/licenses/>.

  Copyright (C) 2021 Lenti84  https://github.com/Lenti84/VdMot_Controller

*END************************************************************************/


#include <stdint.h>
#include <VdmNet.h>
#include <WiFi.h>
#include <WiFiClient.h>

#include "globals.h"
#include "WT32AsyncOTA.h"

#include "web.h"
#include "tfs.h"

#include "time.h"

#include "stm32.h"
#include "stm32ota.h"
#include <ESPmDNS.h>
#include <WiFiUdp.h>
#include "ServerServices.h"
#include "helper.h"
#include "VdmSystem.h"
#include "VdmTask.h"
#include "Services.h"
#include "stmApp.h"
#include "PIControl.h"
#include "Messenger.h"
#include "mqtt.h"

#include <FS.h>
#ifdef USE_LittleFS
  #define SPIFFS LittleFS
  #include <LittleFS.h> 
#else
  #include <SPIFFS.h>
#endif 

extern "C" {
  #include "tfs_data.h"
}


#include <AsyncJson.h>
#include <ArduinoJson.h>

AsyncWebServer server(80);

CServerServices ServerServices;

#define aj  "application/json"
#define tp  "text/plain"
#define th  "text/html"
#define gz  "Content-Encoding : gzip"

#define resOk "{\"res\":\"ok\"}"

// server handles --------------------------------------------------


void restart (JsonObject doc)
{  
  Services.restartSystem(false);
}

void writeConfig (JsonObject doc)
{  
  VdmConfig.writeConfig(true);
}

void resetConfig (JsonObject doc)
{  
  VdmConfig.resetConfig(true);
}

void restoreConfig (JsonObject doc)
{  
  VdmConfig.restoreConfig(true);
}

void setClearFS (JsonObject doc)
{  
  VdmTask.startClearFS();
}

void setGetFS (JsonObject doc)
{  
  VdmTask.startGetFS();
}

void fileDelete (JsonObject doc)
{  
  if (!doc["file"].isNull()) {
    VdmSystem.fileDelete(doc["file"]);
  }
}

void scanTSensors (JsonObject doc)
{  
  StmApp.scanTemps();
}

// "valve": 1..ACTUATOR_COUNT, or 255 / missing for all valves
bool getValveIndex (JsonObject doc, uint8_t* index)
{
  *index=255;
  if (doc["valve"].isNull()) return true;
  long valve;
  if (!jsonToLong(doc["valve"],&valve)) return false;     // number or numeric string
  if (valve==255) return true;
  if ((valve<1) || (valve>ACTUATOR_COUNT)) return false;
  *index=valve-1;
  return true;
}

void valvesCalibration (JsonObject doc)
{  
  uint8_t index;
  if (getValveIndex(doc,&index)) StmApp.valvesCalibration(index);
}

void valvesAssembly (JsonObject doc)
{  
  uint8_t index;
  if (getValveIndex(doc,&index)) StmApp.valvesAssembly(index);
}

void valvesDetect (JsonObject doc)
{  
  StmApp.valvesDetect();
}

void writeValvesControl (JsonObject doc)
{  
  VdmConfig.writeValvesControlConfig(false,VdmTask.restartPiTask);
  Mqtt.forceReconnect=true;
}

void mqttReconnect (JsonObject doc)
{  
  Mqtt.disconnect();
}

void scanWifi (JsonObject doc)
{  
  #ifdef netDebugWIFI
    UART_DBG.println("server servíces cmd : scan wifi "+String(VdmTask.taskIdScanWiFi));
  #endif
  VdmNet.wifiScanState = wifiScanIdle;
  VdmNet.scanRepeatWifi = 0;
  if (VdmTask.taskIdScanWiFi==TASKMGR_INVALIDID) {
      #ifdef netDebugWIFI
            UART_DBG.println("server servíces cmd : Start scan wifi task");
      #endif
      VdmTask.startScanWifi();
  }
}

void sysLogSave (JsonObject doc)
{  
  VdmConfig.writeSysLogValues();
  VdmNet.syslogStarted=false;
  VdmNet.startSysLog();
}

void discoveryHA (JsonObject doc)
{  
  if (Mqtt.hadState==HAD_IDLE) {
    if (!doc["actionHA"].isNull()) 
      Mqtt.actionHA = doc["actionHA"];
    else Mqtt.actionHA = HA_DISCOVERY_ONLY;
    Mqtt.hadState=HAD_STARTED;
  }
}

// returns false when the valve number or a given target (0..100 %) is invalid
bool CServerServices::postSetValve (JsonObject doc)
{
  uint8_t index;
  bool ok=true;
  if (!doc["valve"].isNull()) {
    index=(doc["valve"].as<uint8_t>())-1;
    if (index<ACTUATOR_COUNT) {
      if (VdmConfig.configFlash.valvesConfig.valveConfig[index].active) {
        if (!doc["value"].isNull()) {
          // the web UI posts the input field value as a string
          long target;
          if (jsonToLong(doc["value"],&target) && (target>=0) && (target<=100)) {
            StmApp.actuators[index].target_position = target;
          } else ok=false;
        }
      }
      if (VdmConfig.configFlash.valvesControlConfig.valveControlConfig[index].controlFlags.active) {
        if (VdmConfig.configFlash.valvesControlConfig.valveControlConfig[index].valueSource==3) {
          if (!doc["ctrlValue"].isNull()) PiControl[index].value = doc["ctrlValue"];
          #ifdef EnvDevelop
            UART_DBG.println("ctrlValue : "+String(PiControl[index].value));
          #endif
          jsonSetValveReceived=true;
        }
        if (VdmConfig.configFlash.valvesControlConfig.valveControlConfig[index].targetSource==1) {
          if (!doc["ctrlTarget"].isNull()) {
            PiControl[index].target = doc["ctrlTarget"];
            #ifdef EnvDevelop
            UART_DBG.println("ctrlTarget : "+String(PiControl[index].target));
            #endif
            jsonSetValveReceived=true;
          }
          if (!doc["ctrlDynOffs"].isNull()) PiControl[index].dynOffset = doc["ctrlDynOffs"];
        }
      }
    } else ok=false;
  }
  return ok;
}

String getContentType(String filename) 
{ // convert the file extension to the MIME type
  if (filename.endsWith(".html")) return th;
  else if (filename.endsWith(".css")) return "text/css";
  else if (filename.endsWith(".js")) return "application/javascript";
  else if (filename.endsWith(".ico")) return "image/x-icon";
  else if (filename.endsWith(".gz")) return "application/x-gzip";
  return tp;
}

int8_t checkEntry (String url) 
{
  int8_t i = 0;
  TFS_DIR_ENTRY *entry = (TFS_DIR_ENTRY*) tfs_data;
  String thisUrl=url;
  if (url=="/") thisUrl = "/index.html";
 
