hubertciebiada/VdMot_Controller/software_esp32/src/ServerServices.cpp
  while (entry->NAME != NULL) {
      if (thisUrl == String(entry->NAME)) {
        return(i);
      }
      entry++;
      i++;
  }
  
  return(-1);
}

void handleRoot(AsyncWebServerRequest *request) 
{
  int8_t index;
  
  index=checkEntry(request->url());
  if (index>=0) {
    AsyncWebServerResponse *response = request->beginResponse_P(200, getContentType (tfs_data[index].NAME), 
                                      tfs_data[index].DATA, tfs_data[index].SIZE);
    response->addHeader("Content-Encoding", "gzip");
    request->send(response);
  } else {
    String message = "File "+request->url()+" Not Found\n\n"; 
    request->send(404, tp, message);
  }
}


void handleWebPageStmUpdate(AsyncWebServerRequest *request) 
{
  int8_t index;
  String thisUrl = request->url();
  if (!thisUrl.endsWith(".html")) thisUrl+=".html";
  index=checkEntry(thisUrl);
  if (index>=0) {
    AsyncWebServerResponse *response = request->beginResponse_P(200, getContentType (tfs_data[index].NAME), 
                                      tfs_data[index].DATA, tfs_data[index].SIZE);
    response->addHeader("Content-Encoding", "gzip");
    request->send(response);
  } else {
    String message = "File "+request->url()+" Not Found\n\n"; 
    request->send(404, tp, message);
  }
}

void handleNotFound(AsyncWebServerRequest *request)
{
  if (checkEntry(request->url())>=0) {
    handleRoot(request); 
  } else {

    String message = "File Not Found\n\n";

    message += "URI: ";
    //message += server.uri();
    message += request->url();
    message += "\nMethod: ";
    message += (request->method() == HTTP_GET) ? "GET" : "POST";
    message += "\nArguments: ";
    message += request->args();
    message += "\n";

    for (uint8_t i = 0; i < request->args(); i++) {
      message += " " + request->argName(i) + ": " + request->arg(i) + "\n";
    }
    request->send(404, tp, message);
  }
}

void handleValves(AsyncWebServerRequest *request)
{
  request->send(200,aj,Web.getValvesStatus());
}

void handleTemps(AsyncWebServerRequest *request)
{
  request->send(200,aj,Web.getTempsStatus(VdmConfig.configFlash.tempsConfig));
}

void handleVolts(AsyncWebServerRequest *request)
{
  request->send(200,aj,Web.getVoltsStatus(VdmConfig.configFlash.voltsConfig));
}

void handleNetInfo(AsyncWebServerRequest *request) 
{ 
  request->send(200,aj,Web.getNetInfo(VdmNet.networkInfo));
}

void handleSSIDInfo(AsyncWebServerRequest *request) 
{ 
  request->send(200,aj,Web.getSSIDInfo());
}

void handleNetConfig(AsyncWebServerRequest *request)
{
  request->send(200,aj,Web.getNetConfig(VdmConfig.configFlash.netConfig));
}

void handleProtConfig(AsyncWebServerRequest *request)
{
  request->send(200,aj,Web.getProtConfig(VdmConfig.configFlash.protConfig));
}

void handleValvesConfig(AsyncWebServerRequest *request)
{
  request->send(200,aj,Web.getValvesConfig (VdmConfig.configFlash.valvesConfig));
}

void handleMotorConfig(AsyncWebServerRequest *request)
{
  request->send(200,aj,Web.getMotorConfig (StmApp.motorChars));
}

void handleValvesControlConfig(AsyncWebServerRequest *request)
{
  request->send(200,aj,Web.getValvesControlConfig (VdmConfig.configFlash.valvesControlConfig));
}

void handleTempsConfig(AsyncWebServerRequest *request)
{
  request->send(200,aj,Web.getTempsConfig (VdmConfig.configFlash.tempsConfig));
}

void handleTempSensorsID(AsyncWebServerRequest *request)
{
  request->send(200,aj,Web.getTempSensorsID ());
}

void handleVoltsConfig(AsyncWebServerRequest *request)
{
  request->send(200,aj,Web.getVoltsConfig (VdmConfig.configFlash.voltsConfig));
}

void handleVoltSensorsID(AsyncWebServerRequest *request)
{
  request->send(200,aj,Web.getVoltSensorsID ());
}

void handleSysInfo(AsyncWebServerRequest *request) 
{ 
  request->send(200,aj,Web.getSysInfo());
}

void handleSysDynInfo(AsyncWebServerRequest *request) 
{ 
  request->send(200,aj,Web.getSysDynInfo());
}

void handleGetSysConfig(AsyncWebServerRequest *request) 
{ 
  request->send(200,aj,Web.getSysConfig(VdmConfig.configFlash.systemConfig));
}

void handleGetMsgConfig(AsyncWebServerRequest *request) 
{ 
  request->send(200,aj,Web.getMsgConfig(VdmConfig.configFlash.messengerConfig));
}

void handleGetStm(AsyncWebServerRequest *request) 
{ 
  // generate callback with request parameter
  // send request answer after getting from stm 
}

void handleGetFSDir(AsyncWebServerRequest *request) 
{ 
  request->send(200,aj,Web.getFSDir());
}

void handleStmUpdStatus(AsyncWebServerRequest *request) 
{ 
  request->send(200,aj,Web.getStmUpdStatus());
}


bool handleCmd(JsonObject doc) 
{ 
  typedef void (*fp)(JsonObject doc);
  fp  fpList[] = {&restart,&writeConfig,&resetConfig,&restoreConfig,&fileDelete,&setGetFS,
                  &setClearFS,&scanTSensors,&valvesCalibration,&valvesAssembly,&valvesDetect,&writeValvesControl,&mqttReconnect,&sysLogSave,&discoveryHA,&scanWifi} ;

  char const *names[]=  {"reboot", "saveCfg","resetCfg","restoreCfg","fDelete","getFS",
                        "clearFS","scanTempSensors","vCalib","vAssembly","valvesDetect","vCtrlSave","mqttReconnect","sysLogSave","discoveryHA","scanWifi",NULL};
  char const **p;
  bool found = false;

  if (doc["action"].is<const char*>()) {      // a non-string action would give NULL
    const char* d=doc["action"].as<const char*>();
    uint8_t i=0;
  
    for (p=names; *p!=NULL; p++) {
      if (strcmp(d, *p)==0) {
        fpList[i](doc);
        found=true;
        break;
      }
      i++;
    }
  }
  return (found);
}

// LittleFS paths must be absolute
String uploadFilePath(const String& filename)
{
  return filename.startsWith("/") ? filename : "/"+filename;
}

// an upload is written to <name>.part and renamed to <name> only when it is
// complete, so an interrupted upload never leaves a truncated file under the
// real name (and never replaces a good file of that name)
static const char uploadTempSuffix[] = ".part";

// the request handler answers; a non-NULL _tempObject marks a failed upload
void markUploadFailed(AsyncWebServerRequest *request)
{
  if (request->_tempObject == NULL) request->_tempObject = malloc(1);
}

void handleUploadFile(AsyncWebServerRequest *request, const String& filename, size_t index, 
            uint8_t *data, size_t len, bool final)
{
  if(!index){
    String thisFileName = uploadFilePath(filename);
    String tempFileName = thisFileName + uploadTempSuffix;
    // open the file on first call and store the file handle in the request object
    #ifdef EnvDevelop
      UART_DBG.println("file has arguments : "+String(request->args()));
      UART_DBG.println("filename : "+thisFileName);
    #endif
    if (SPIFFS.exists(tempFileName)) SPIFFS.remove(tempFileName);   // left by an earlier interrupted upload
    request->_tempFile = SPIFFS.open(tempFileName, "w");
    if (!request->_tempFile) markUploadFailed(request);
    else {
      // client gone before the last chunk: drop the partial file
      request->onDisconnect([request, tempFileName]() {
        if (request->_tempFile) {
          request->_tempFile.close();
          SPIFFS.remove(tempFileName);
        }
      });
    }
  }
  if(len && request->_tempFile) {
    // stream the incoming chunk to the opened file
    if (request->_tempFile.write(data,len) != len) {
      // FS full: never leave a truncated (STM firmware) file behind
      request->_tempFile.close();
      SPIFFS.remove(uploadFilePath(filename) + uploadTempSuffix);
      markUploadFailed(request);
    }
  }
  if(final){
    // close the file handle as the upload is now done, then publish it under its name
    if (request->_tempFile) {
      String thisFileName = uploadFilePath(filename);
      String tempFileName = thisFileName + uploadTempSuffix;
      request->_tempFile.close();
      if (SPIFFS.exists(thisFileName)) SPIFFS.remove(thisFileName);
      if (!SPIFFS.rename(tempFileName, thisFileName)) {
        SPIFFS.remove(tempFileName);
        markUploadFailed(request);
      }
    }
    #ifdef EnvDevelop
      UART_DBG.println("upload finished");
    #endif
  }
  
