hubertciebiada/VdMot_Controller/software_esp32/src/ServerServices.cpp
}

CServerServices::CServerServices()
{
  jsonSetValveReceived=false;
}

// returns the HTTP status: 200 started, 400 bad request, 409 refused
int CServerServices::stmDoUpdate(JsonObject doc)
{
  const char* file = doc["file"].as<const char*>();
  if ((file == NULL) || (*file == '\0') || doc["cmd"].isNull()) return 400;
  String thisFileName = uploadFilePath(file);
  // never flash what is left of an interrupted upload
  if (thisFileName.endsWith(uploadTempSuffix)) return 400;
  uint8_t command = doc["cmd"];
  #ifdef EnvDevelop
    UART_DBG.println("file : "+thisFileName + " Command "+ String(command));
  #endif
  bool started;
  if (command==0) started=VdmTask.startStm32Ota(STM32OTA_START,thisFileName);
  else if (command==1) started=VdmTask.startStm32Ota(STM32OTA_STARTBLANK,thisFileName);
  else return 400;
  return started ? 200 : 409;
}

void  CServerServices::initServer() 
{
  // define on events
  server.on("/", HTTP_GET, [](AsyncWebServerRequest * request) {handleRoot(request);});
  server.onNotFound(handleNotFound);
  server.on("/valves",HTTP_GET,[](AsyncWebServerRequest * request) {handleValves(request);});
  server.on("/temps",HTTP_GET,[](AsyncWebServerRequest * request) {handleTemps(request);});
  server.on("/volts",HTTP_GET,[](AsyncWebServerRequest * request) {handleVolts(request);});
  server.on("/netinfo",HTTP_GET,[](AsyncWebServerRequest * request) {handleNetInfo(request);});
  server.on("/ssidinfo",HTTP_GET,[](AsyncWebServerRequest * request) {handleSSIDInfo(request);});
  server.on("/netconfig",HTTP_GET,[](AsyncWebServerRequest * request) {handleNetConfig(request);});
  server.on("/protconfig",HTTP_GET,[](AsyncWebServerRequest * request) {handleProtConfig(request);});
  server.on("/valvesconfig",HTTP_GET,[](AsyncWebServerRequest * request) {handleValvesConfig(request);});
  server.on("/motorconfig",HTTP_GET,[](AsyncWebServerRequest * request) {handleMotorConfig(request);});
  server.on("/valvesctrlconfig",HTTP_GET,[](AsyncWebServerRequest * request) {handleValvesControlConfig(request);});
  server.on("/tempsconfig",HTTP_GET,[](AsyncWebServerRequest * request) {handleTempsConfig(request);});
  server.on("/voltsconfig",HTTP_GET,[](AsyncWebServerRequest * request) {handleVoltsConfig(request);});
  server.on("/sysinfo",HTTP_GET,[](AsyncWebServerRequest * request) {handleSysInfo(request);});
  server.on("/sysdyninfo",HTTP_GET,[](AsyncWebServerRequest * request) {handleSysDynInfo(request);});
  server.on("/fsdir",HTTP_GET,[](AsyncWebServerRequest * request) {handleGetFSDir(request);});
  server.on("/stmupdate", HTTP_GET, [](AsyncWebServerRequest * request) {handleWebPageStmUpdate(request);});
  server.on("/stmupdstatus", HTTP_GET, [](AsyncWebServerRequest * request) {handleStmUpdStatus(request);});
  server.on("/tempsensorsid", HTTP_GET, [](AsyncWebServerRequest * request) {handleTempSensorsID(request);});
  server.on("/voltsensorsid", HTTP_GET, [](AsyncWebServerRequest * request) {handleVoltSensorsID(request);});
  server.on("/sysconfig", HTTP_GET, [](AsyncWebServerRequest * request) {handleGetSysConfig(request);});
  server.on("/msgconfig", HTTP_GET, [](AsyncWebServerRequest * request) {handleGetMsgConfig(request);});
  server.on("/stm?", HTTP_GET, [](AsyncWebServerRequest * request) {handleGetStm(request);});
  
  server.on("/fupload", HTTP_POST, [](AsyncWebServerRequest *request) {
      // called once after the upload (also when the request carried no file)
      if (request->_tempObject != NULL) request->send(500, tp, "Upload failed");
      else request->send(200, aj, Web.getFSDir());
    },
      [](AsyncWebServerRequest *request, const String& filename, size_t index, uint8_t *data,
                    size_t len, bool final) {handleUploadFile(request, filename, index, data, len, final);}
  );

  AsyncCallbackJsonWebHandler* stmDoUpdateHandler = new AsyncCallbackJsonWebHandler("/stmdoupdate", [](AsyncWebServerRequest *request, JsonVariant &json) {
    if (json.is<JsonObject>()) {
      JsonObject&& jsonObj = json.as<JsonObject>();
      int status = ServerServices.stmDoUpdate (jsonObj);
      if (status == 200) request->send(200, aj, resOk);
      else if (status == 409) request->send(409, tp, "STM update refused: one update per boot or restart pending");
      else request->send(400, tp, "Invalid file or command");
    } else request->send(400, tp, "Not an object");
  });
  server.addHandler(stmDoUpdateHandler);

  AsyncCallbackJsonWebHandler* setValveHandler = new AsyncCallbackJsonWebHandler("/setvalve", [](AsyncWebServerRequest *request, JsonVariant &json) {
    if (json.is<JsonObject>()) {
      JsonObject&& jsonObj = json.as<JsonObject>();
      if (ServerServices.postSetValve (jsonObj)) request->send(200, aj, resOk);
      else request->send(400, tp, "Invalid valve or target");
    } else request->send(400, tp, "Not an object");
  });
  server.addHandler(setValveHandler);

  AsyncCallbackJsonWebHandler* netCfgHandler = new AsyncCallbackJsonWebHandler("/netconfig", [](AsyncWebServerRequest *request, JsonVariant &json) {
    if (json.is<JsonObject>()) {
      JsonObject&& jsonObj = json.as<JsonObject>();
      VdmConfig.postNetCfg (jsonObj);
      request->send(200, aj, resOk);
    } else request->send(400, tp, "Not an object");
  });
  server.addHandler(netCfgHandler);

  AsyncCallbackJsonWebHandler* sysLogCfgHandler = new AsyncCallbackJsonWebHandler("/sysLogCfg", [](AsyncWebServerRequest *request, JsonVariant &json) {
    if (json.is<JsonObject>()) {
      JsonObject&& jsonObj = json.as<JsonObject>();
      VdmConfig.postSysLogCfg (jsonObj);
      request->send(200, aj, resOk);
    } else request->send(400, tp, "Not an object");
  });
  server.addHandler(sysLogCfgHandler);  
  
  AsyncCallbackJsonWebHandler* protCfgHandler = new AsyncCallbackJsonWebHandler("/protconfig", [](AsyncWebServerRequest *request, JsonVariant &json) {
    if (json.is<JsonObject>()) {
      JsonObject&& jsonObj = json.as<JsonObject>();
      VdmConfig.postProtCfg (jsonObj);
      request->send(200, aj, resOk);
    } else request->send(400, tp, "Not an object");
  });
  server.addHandler(protCfgHandler);

